
p = 0;q = 1;n = 2;k = 2;
syms x1 x2;
c00 = 0;        
c10 = 0; c01 = 0;
c20 = -5; c02 = 2; c11 = 3;
% Полином по формуле 4.3 (классическая форма):
g0 = c00;
g1 = c10*x1 + c01*x2;
g2 = c20*x1^2 + c02*x2^2 + c11*x1*x2;
y1 = g0 + g1 + g2;
% Полином по формуле 4.8 (многомерно-матричная форма):
X = [x1, x2];
c1 = [0, 0];  
c2 = [-5, 1.5; 1.5, 2]; 
g0 = zeros(1, 1); g1 = 0; g2 = 0;
for i = 1:2
    g1 = g1 + c1(i) * X(i); 
    for j = 1:2
        g2 = g2 + c2(i,j) * X(i) * X(j);  
    end
end
y2 = g0 + g1 + g2;  
aa = -2:0.5:2;
bb = -2:0.5:2;
[x, y] = meshgrid(aa, bb);
% График классического полинома
Fig1 = subs(y1, {x1,x2}, {x, y});
Fig1 = double(Fig1);
figure;
subplot(2, 3, [1 2 4 5]);  %будет занимать ячейки 1, 2, 5 и 5
meshc(x, y, Fig1);  
title('Классическая форма полинома');
grid on;
subplot(2, 3, 3);  
contour(x, y, Fig1);  
title('Контурный график (Классическая форма)');
grid on;
% График многомерно-матричного полинома
Fig2 = subs(y2, {x1,x2}, {x, y});
Fig2 = double(Fig2);
figure;
subplot(2, 3, [1 2 4 5]);  
meshc(x, y, Fig2);  
title('Многомерно-матричная форма');
grid on;
subplot(2, 3, 3);  
contour(x, y, Fig2); 
title('Контурный график (Матричная форма)');
grid on;